{
  "<PAD>": 0,
  "<BOS>": 1,
  "<EOS>": 2,
  "<UNK>": 3,
  "<MOSFET>": 4,
  "<IGBT>": 5,
  "<IC>": 6,
  "<N1>": 7,
  "<N2>": 8,
  "<N3>": 9,
  "<N4>": 10,
  "<N5>": 11,
  "<N6>": 12,
  "<N7>": 13,
  "<N8>": 14,
  "<N9>": 15,
  "ALIGN MASK LEVEL": 16,
  "ANISOTROPIC ETCH SPACER": 17,
  "ANNEAL DIELECTRIC": 18,
  "ANNEAL METAL": 19,
  "ANNEAL OXIDE": 20,
  "ANNEAL POLYSILICON": 21,
  "BACKSIDE ANNEAL": 22,
  "BACKSIDE CLEAN": 23,
  "BACKSIDE CLEAN FINAL": 24,
  "BACKSIDE DRY": 25,
  "BACKSIDE ETCH CLEAN": 26,
  "BACKSIDE GRIND": 27,
  "BACKSIDE METALLIZATION PREP": 28,
  "BACKSIDE RINSE": 29,
  "BACKSIDE THINNING CHECK": 30,
  "BREAKDOWN VOLTAGE TEST": 31,
  "CLEAN AFTER ETCH": 32,
  "CLEAN AFTER FIELD ETCH": 33,
  "CLEAN AFTER METAL ETCH": 34,
  "CLEAN AFTER OXIDE ETCH": 35,
  "CLEAN AFTER POLY ETCH": 36,
  "CLEAN AFTER VIA ETCH": 37,
  "CLEAN AFTER WINDOW ETCH": 38,
  "CLEAN PAD OPENING": 39,
  "CMP DIELECTRIC": 40,
  "CMP INTERLAYER DIELECTRIC": 41,
  "CMP METAL": 42,
  "CMP VIA FILL": 43,
  "CURE PASSIVATION": 44,
  "DENSIFY DIELECTRIC": 45,
  "DENSIFY OXIDE": 46,
  "DEPOSIT BACKSIDE METAL": 47,
  "DEPOSIT BACKSIDE PROTECTION": 48,
  "DEPOSIT BARRIER METAL": 49,
  "DEPOSIT FIELD OXIDE": 50,
  "DEPOSIT GATE OXIDE OR DIELECTRIC": 51,
  "DEPOSIT INTERLAYER DIELECTRIC": 52,
  "DEPOSIT INTERLEVEL DIELECTRIC": 53,
  "DEPOSIT METAL": 54,
  "DEPOSIT METAL SEED": 55,
  "DEPOSIT PAD OXIDE": 56,
  "DEPOSIT PASSIVATION": 57,
  "DEPOSIT PASSIVATION LAYER": 58,
  "DEPOSIT POLYSILICON": 59,
  "DEPOSIT SPACER DIELECTRIC": 60,
  "DEPOSIT TOP METAL": 61,
  "DEPOSIT TUNGSTEN SEED": 62,
  "DEVELOP PAD WINDOW": 63,
  "DEVELOP PHOTORESIST": 64,
  "DIELECTRIC ETCH VIA": 65,
  "DRIVE IN DIFFUSION": 66,
  "DRY WAFER": 67,
  "DRY WAFER BACKSIDE": 68,
  "ELECTRICAL PARAMETRIC TEST": 69,
  "EPITAXIAL DEPOSITION": 70,
  "EPITAXIAL LAYER PREP": 71,
  "EPITAXIAL REWORK CHECK": 72,
  "EPITAXIAL WAFER CHECK": 73,
  "EPITAXY ANNEAL": 74,
  "EPITAXY PREP": 75,
  "ETCH SILICON OR OXIDE WINDOW": 76,
  "ETCH WET BACKSIDE": 77,
  "EXPOSE LITHO LEVEL": 78,
  "FIELD OXIDE ETCH": 79,
  "FIELD PATTERN INSPECTION": 80,
  "FILL VIA METAL": 81,
  "FILL VIA TUNGSTEN": 82,
  "FINAL CD INSPECTION": 83,
  "FINAL CLEAN": 84,
  "FINAL ELECTRICAL TEST PREP": 85,
  "FINAL GEOMETRY CHECK": 86,
  "FINAL LOT RELEASE": 87,
  "FINAL OXIDE CHECK": 88,
  "FINAL PARTICLE INSPECTION": 89,
  "FINAL THICKNESS MEASURE": 90,
  "FRONTSIDE CLEAN": 91,
  "FRONTSIDE CLEAN FINAL": 92,
  "GATE OXIDE GROWTH": 93,
  "GATE OXIDE PREP": 94,
  "GRINDING WAFER BACKSIDE": 95,
  "HARD BAKE": 96,
  "HF DIP": 97,
  "IMPLANT CHANNEL STOP": 98,
  "IMPLANT DRAIN / CATHODE REGION": 99,
  "IMPLANT LDD": 100,
  "IMPLANT N BUFFER": 101,
  "IMPLANT N-TYPE": 102,
  "IMPLANT P BODY": 103,
  "IMPLANT SOURCE DRAIN": 104,
  "IMPLANT SOURCE REGION": 105,
  "IMPLANT WELL": 106,
  "INITIAL WAFER INSPECTION": 107,
  "INSPECT PATTERN LEVEL": 108,
  "LEAKAGE TEST": 109,
  "LIGHT ANNEAL": 110,
  "LOT IDENTIFICATION": 111,
  "LOT RELEASE": 112,
  "MEASURE BACKSIDE CONTACT": 113,
  "MEASURE BACKSIDE ROUGHNESS": 114,
  "MEASURE CD LEVEL": 115,
  "MEASURE CONTACT RESISTANCE": 116,
  "MEASURE DEVICE PARAMETER": 117,
  "MEASURE DIELECTRIC THICKNESS": 118,
  "MEASURE EPITAXY THICKNESS": 119,
  "MEASURE FILM THICKNESS": 120,
  "MEASURE GATE CD": 121,
  "MEASURE GATE OXIDE THICKNESS": 122,
  "MEASURE GEOMETRY": 123,
  "MEASURE INITIAL GEOMETRY": 124,
  "MEASURE INITIAL THICKNESS": 125,
  "MEASURE JUNCTION DEPTH": 126,
  "MEASURE JUNCTION PROFILE": 127,
  "MEASURE LINE WIDTH": 128,
  "MEASURE METAL THICKNESS": 129,
  "MEASURE OPENING CD": 130,
  "MEASURE OXIDE QUALITY": 131,
  "MEASURE OXIDE THICKNESS": 132,
  "MEASURE PAD OPENING": 133,
  "MEASURE PASSIVATION QUALITY": 134,
  "MEASURE PASSIVATION THICKNESS": 135,
  "MEASURE PLANARITY": 136,
  "MEASURE POLY THICKNESS": 137,
  "MEASURE RESISTIVITY": 138,
  "MEASURE SHEET RESISTANCE": 139,
  "MEASURE SPACER WIDTH": 140,
  "MEASURE SURFACE DEFECTS": 141,
  "MEASURE SURFACE PARTICLES": 142,
  "MEASURE SURFACE PLANARITY": 143,
  "MEASURE SURFACE UNIFORMITY": 144,
  "MEASURE THICKNESS": 145,
  "MEASURE VIA CD": 146,
  "MEASURE VIA RESISTANCE": 147,
  "MEASURE WAFER THICKNESS": 148,
  "MEASURE WINDOW CD": 149,
  "METAL ETCH": 150,
  "METAL ETCH DRY": 151,
  "METAL PATTERN INSPECTION": 152,
  "OPEN BOND PAD WINDOW": 153,
  "OPEN PAD WINDOW": 154,
  "OPEN PAD WINDOW LITHO": 155,
  "OXIDE ETCH": 156,
  "OXIDE ETCH DRY": 157,
  "OXIDE STRIP": 158,
  "P BODY WINDOW INSPECTION": 159,
  "PACKAGE PREPARATION": 160,
  "PAD WINDOW LITHO": 161,
  "PARAMETRIC TEST": 162,
  "PASSIVATION ETCH": 163,
  "PASSIVATION ETCH PAD OPENING": 164,
  "PATTERN INSPECTION LEVEL": 165,
  "POLY PATTERN INSPECTION": 166,
  "POLYSILICON ANNEAL": 167,
  "POLYSILICON ETCH": 168,
  "POLYSILICON ETCH DRY": 169,
  "POST EXPOSE BAKE": 170,
  "PRE ANNEAL CHECK": 171,
  "PRE CLEAN INSPECTION": 172,
  "PRE CLEAN WAFER": 173,
  "RAPID THERMAL ANNEAL": 174,
  "RCA CLEAN": 175,
  "RECEIVE WAFER LOT": 176,
  "RINSE WET WAFER_EDGE": 177,
  "SHIP LOT": 178,
  "SOFT BAKE": 179,
  "SPIN COAT PHOTORESIST": 180,
  "STRIP PHOTORESIST": 181,
  "STRIP RESIST": 182,
  "STRIP RESIST LEVEL": 183,
  "SUBSTRATE CHECK": 184,
  "SURFACE PREP FOR DEPOSITION": 185,
  "SWITCHING TEST": 186,
  "THERMAL OXIDATION": 187,
  "THRESHOLD VOLTAGE TEST": 188,
  "VIA ETCH": 189,
  "VIA ETCH THROUGH DIELECTRIC": 190,
  "VIA INSPECTION": 191,
  "VIA OPENING INSPECTION": 192,
  "WAFER CLEAN PRE PROCESS": 193,
  "WAFER CLEAN PRE-GRIND": 194,
  "WAFER SORT TEST": 195,
  "WAFER SURFACE CLEAN": 196,
  "WET CLEAN RCA1": 197,
  "WET CLEAN RCA2": 198,
  "YIELD ANALYSIS": 199
}